Repository: lcx-seima/hotkey-finder
Catalog: HotkeyFinder/Localizable.xcstrings
Source language: en
Languages: ja, th, zh_hans, zh_hant

source: Allow Input Monitoring
ja: 入力監視を許可
th: อนุญาตการตรวจสอบอินพุต
zh_hans: 允许输入监控
zh_hant: 允許輸入監控

source: Allow Screen Recording
ja: 画面収録を許可
th: อนุญาตการบันทึกหน้าจอ
zh_hans: 允许屏幕录制
zh_hant: 允許螢幕錄製

source: App Activation
ja: アプリのアクティブ化
th: การเปิดใช้งานแอป
zh_hans: App 激活
zh_hant: App 啟用

source: Checking Permissions
ja: 権限を確認中
th: กำลังตรวจสอบสิทธิ์
zh_hans: 正在检查权限
zh_hant: 正在檢查權限

source: Choose the language Hotkey Finder uses.
ja: Hotkey Finder で使用する言語を選択します。
th: เลือกภาษาที่ต้องการใช้ใน Hotkey Finder
zh_hans: 选择 Hotkey Finder 使用的语言。
zh_hant: 選擇 Hotkey Finder 使用的語言。

source: Clear History
ja: 履歴を消去
th: ล้างประวัติ
zh_hans: 清空记录
zh_hant: 清除記錄

source: Couldn’t Restart
ja: 再起動できませんでした
th: เปิดแอปใหม่ไม่ได้
zh_hans: 无法重启
zh_hant: 無法重新啟動

source: Couldn’t start keyboard monitoring. Make sure Input Monitoring access is enabled, then try again or restart the app.
ja: キー入力の監視を開始できませんでした。入力監視が許可されていることを確認してから、もう一度試すかアプリを再起動してください。
th: เริ่มตรวจสอบแป้นพิมพ์ไม่ได้ โปรดตรวจสอบว่าอนุญาตการตรวจสอบอินพุตแล้ว จากนั้นลองอีกครั้งหรือเปิดแอปใหม่
zh_hans: 无法启动键盘监控。请确认已允许输入监控，然后重试或重新启动 App。
zh_hant: 無法啟動鍵盤監控。請確認已允許輸入監控，然後再試一次或重新啟動 App。

source: Current Result
ja: 現在の結果
th: ผลลัพธ์ปัจจุบัน
zh_hans: 当前结果
zh_hant: 目前結果

source: Delete
ja: 削除
zh_hans: 删除
zh_hant: 刪除

source: Detecting
ja: 検出中
th: กำลังตรวจจับ
zh_hans: 正在侦测
zh_hant: 正在偵測

source: Detection Error
ja: 検出エラー
th: การตรวจจับผิดพลาด
zh_hans: 侦测异常
zh_hant: 偵測錯誤

source: Detection results appear here, newest first.
ja: 新しい検出結果から順にここに表示されます。
th: ผลการตรวจจับล่าสุดจะแสดงที่นี่ก่อน
zh_hans: 侦测结果会按时间倒序显示在这里。
zh_hant: 偵測結果會依時間由新到舊顯示在這裡。

source: Enable Window Detection (Optional)
ja: ウインドウ検出を有効にする（任意）
th: เปิดการตรวจจับหน้าต่าง (ไม่บังคับ)
zh_hans: 启用窗口侦测（可选）
zh_hant: 啟用視窗偵測（選用）

source: Event Target
ja: イベントの送信先
th: เป้าหมายอีเวนต์
zh_hans: 事件目标
zh_hant: 事件目標

source: Follow System
ja: システム設定に合わせる
th: ตามภาษาของระบบ
zh_hans: 跟随系统
zh_hant: 依照系統設定

source: Forward Delete
ja: 前方削除
th: ลบไปข้างหน้า
zh_hans: 向前删除
zh_hant: 向前刪除

source: Help
ja: ヘルプ
th: วิธีใช้
zh_hans: 帮助
zh_hant: 輔助說明

source: Helps identify apps like Alfred that do not become active. Hotkey Finder only compares window metadata such as identifiers, owning processes, and sizes. It never captures or saves your screen.
ja: Alfred のようにアクティブにならないアプリを特定するために使用します。Hotkey Finder が参照するのは、ウインドウ識別子、所有プロセス、サイズなどのメタデータだけです。画面を撮影したり保存したりすることはありません。
th: ช่วยระบุแอปอย่าง Alfred ที่ไม่แสดงเป็นแอปที่ใช้งานอยู่ Hotkey Finder จะเปรียบเทียบเฉพาะข้อมูลหน้าต่าง เช่น รหัส โปรเซสเจ้าของ และขนาด โดยจะไม่จับภาพหรือบันทึกหน้าจอของคุณ
zh_hans: 用于识别 Alfred 这类不会激活自身的 App。Hotkey Finder 只比较窗口编号、所属进程和尺寸等元数据，不会截取或保存屏幕画面。
zh_hant: 用來識別 Alfred 這類不會主動啟用的 App。Hotkey Finder 只會比較視窗識別碼、所屬程序和大小等中繼資料，不會擷取或儲存螢幕畫面。

source: Home
ja: ホーム

source: Hotkey Finder couldn’t restart automatically. Quit and reopen the app to apply the language change.
ja: Hotkey Finder を自動的に再起動できませんでした。アプリを終了してもう一度開くと、言語の変更が反映されます。
th: Hotkey Finder ไม่สามารถเปิดใหม่โดยอัตโนมัติได้ โปรดออกจากแอปแล้วเปิดอีกครั้งเพื่อใช้ภาษาที่เลือก
zh_hans: Hotkey Finder 无法自动重启。请退出并重新打开 App，以应用语言更改。
zh_hant: Hotkey Finder 無法自動重新啟動。請結束並重新開啟 App，以套用語言變更。

source: Hotkey Finder reads keyboard events only while its window is in front so it can identify which app receives a shortcut. It never changes or blocks your keystrokes.
ja: Hotkey Finder は、ウインドウが前面にある間だけキー入力イベントを読み取り、ショートカットを受け取ったアプリを特定します。キー入力を変更したりブロックしたりすることはありません。
th: Hotkey Finder จะอ่านอีเวนต์จากแป้นพิมพ์เฉพาะตอนที่หน้าต่างอยู่ด้านหน้า เพื่อระบุว่าแอปใดได้รับปุ่มลัด โดยจะไม่แก้ไขหรือบล็อกการกดแป้นของคุณ
zh_hans: Hotkey Finder 仅在窗口位于前台时读取键盘事件，用于判断哪个 App 收到了快捷键。它不会修改或拦截你的按键。
zh_hant: Hotkey Finder 只會在視窗位於最前方時讀取鍵盤事件，用來判斷哪個 App 收到快速鍵。它不會修改或攔截你的按鍵。

source: Input Monitoring Access Required
ja: 入力監視の許可が必要です
th: ต้องอนุญาตการตรวจสอบอินพุต
zh_hans: 需要输入监控权限
zh_hant: 需要輸入監控權限

source: Keep this window in front, then press the shortcut you want to inspect.
ja: このウインドウを前面に表示したまま、調べたいショートカットを押してください。
th: วางหน้าต่างนี้ไว้ด้านหน้า แล้วกดปุ่มลัดที่ต้องการตรวจสอบ
zh_hans: 保持此窗口在前台，然后按下要检查的快捷键。
zh_hant: 將此視窗保持在最前方，然後按下想要檢查的快速鍵。

source: KeyCode %d
ja: キーコード %d
th: รหัสปุ่ม %d
zh_hans: 键码 %d
zh_hant: 按鍵碼 %d

source: Language
ja: 言語
th: ภาษา
zh_hans: 语言
zh_hant: 語言

source: Later
ja: 後で
th: ไว้ภายหลัง
zh_hans: 稍后
zh_hant: 稍後

source: New Window
ja: 新規ウインドウ
th: หน้าต่างใหม่
zh_hans: 新窗口
zh_hant: 新視窗

source: No Bundle ID
ja: Bundle ID なし
th: ไม่มี Bundle ID
zh_hans: 无 Bundle ID
zh_hant: 無 Bundle ID

source: No Responding App Detected
ja: 反応したアプリは見つかりませんでした
th: ไม่พบแอปที่ตอบสนอง
zh_hans: 未侦测到响应的 App
zh_hant: 未偵測到有回應的 App

source: Open System Settings
ja: システム設定を開く
th: เปิดการตั้งค่าระบบ
zh_hans: 打开系统设置
zh_hant: 打開系統設定

source: Paused
ja: 一時停止
th: หยุดชั่วคราว
zh_hans: 已暂停
zh_hant: 已暫停

source: Permission Required
ja: 権限が必要です
th: ต้องอนุญาตสิทธิ์
zh_hans: 需要权限
zh_hant: 需要權限

source: Recent Activity
ja: 最近の検出
th: กิจกรรมล่าสุด
zh_hans: 最近活动
zh_hant: 最近的活動

source: Restart Hotkey Finder?
ja: Hotkey Finder を再起動しますか？
th: เปิด Hotkey Finder ใหม่หรือไม่
zh_hans: 重新启动 Hotkey Finder？
zh_hant: 要重新啟動 Hotkey Finder 嗎？

source: Restart Now
ja: 今すぐ再起動
th: เปิดใหม่ตอนนี้
zh_hans: 立即重启
zh_hant: 立即重新啟動

source: Restart required to apply this change.
ja: 変更を反映するには再起動が必要です。
th: ต้องเปิดแอปใหม่เพื่อใช้การเปลี่ยนแปลงนี้
zh_hans: 需要重启才能应用此更改。
zh_hant: 需要重新啟動才能套用此變更。

source: Shortcuts with modifiers and F1–F20 are supported.
ja: 修飾キーを含むショートカットと F1〜F20 に対応しています。
th: รองรับปุ่มลัดที่ใช้ปุ่มปรับค่าและปุ่ม F1–F20
zh_hans: 支持带修饰键的组合键以及 F1–F20。
zh_hant: 支援包含變更鍵的快速鍵以及 F1–F20。

source: Space
ja: スペース
zh_hans: 空格
zh_hant: 空白鍵

source: System match:
ja: システムに合わせた言語：
th: ภาษาที่ระบบเลือก:
zh_hans: 系统匹配：
zh_hant: 系統符合語言：

source: The event is still targeting Hotkey Finder.
ja: イベントの送信先は引き続き Hotkey Finder です。
th: อีเวนต์ยังคงส่งไปยัง Hotkey Finder
zh_hans: 该事件仍然指向 Hotkey Finder。
zh_hant: 此事件仍然指向 Hotkey Finder。

source: The language change will take effect after Hotkey Finder restarts.
ja: Hotkey Finder を再起動すると、言語の変更が反映されます。
th: ภาษาที่เลือกจะมีผลหลังจากเปิด Hotkey Finder ใหม่
zh_hans: 重新启动 Hotkey Finder 后，语言更改才会生效。
zh_hant: 重新啟動 Hotkey Finder 後，語言變更才會生效。

source: The system did not provide a valid target PID.
ja: 有効な対象 PID がシステムから返されませんでした。
th: ระบบไม่ได้ระบุ PID เป้าหมายที่ถูกต้อง
zh_hans: 系统没有提供有效的目标 PID。
zh_hant: 系統未提供有效的目標 PID。

source: Try Again
ja: もう一度試す
th: ลองอีกครั้ง
zh_hans: 重试
zh_hant: 再試一次

source: Unable to Identify Target Process
ja: 対象プロセスを特定できません
th: ระบุโปรเซสเป้าหมายไม่ได้
zh_hans: 无法识别目标进程
zh_hant: 無法識別目標程序

source: Unable to Start Detection
ja: 検出を開始できません
th: เริ่มการตรวจจับไม่ได้
zh_hans: 无法启动侦测
zh_hant: 無法開始偵測

source: Waiting for a Shortcut
ja: ショートカットを待機中
th: กำลังรอปุ่มลัด
zh_hans: 等待快捷键
zh_hant: 等待快速鍵

source: OK
th: ตกลง
zh_hans: 好
zh_hant: 好

source: Return
th: Enter
zh_hans: 回车

source: Page Down
zh_hans: 下一页
zh_hant: 下一頁

source: Page Up
zh_hans: 上一页
zh_hant: 上一頁
